Revit 2027 API
AnalysisDisplayDiagramSettings Constructor
 Constructs a default instance of diagram settings.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public AnalysisDisplayDiagramSettings()
Public Sub New
public:
AnalysisDisplayDiagramSettings()
new : unit -> AnalysisDisplayDiagramSettings
See Also
Reference
AnalysisDisplayDiagramSettings Class
AnalysisDisplayDiagramSettings Overload
Autodesk.Revit.DB.Analysis Namespace